app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("coursename", "teacher", "studentnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["coursename", "Advanced Software Engireering"], ["teacher", "Tiejian Luo"], ["studentnumber", 1], ["created_at", "2017-11-10 14:26:30.252815"], ["updated_at", "2017-11-10 14:26:30.252815"]]

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "coursename" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["coursename", "Advanced Software Engineering"], ["updated_at", "2017-11-10 14:26:46.015531"], ["id", 1]]